language_codes = {
    "🇺🇦 Українська": "UA",
    "🇬🇧 English": "EN",
    "🇷🇺 Русский": "RU",
}

CHOOSE_LANGUAGE = {
    "UA": "Привіт! Обери бажану мову для спілкування з ботом:",
    "RU": "Привет! Выбери желаемый язык для общения с ботом:",
    "EN": "Hello! Choose the language you want to communicate with the bot:",
}

CHOOSE_SEX = {
    "UA": "Якої ти статі?",
    "RU": "Укажи свой пол:",
    "EN": "Select your sex:",
}

MAN = {
    "UA": "Хлопець",
    "RU": "Парень",
    "EN": "Boy",
}

WOMAN = {
    "UA": "Дівчина",
    "RU": "Девушка",
    "EN": "Girl",
}

ENTER_AGE = {
    "UA": "Скільки тобі років?",
    "RU": "Сколько тебе лет?",
    "EN": "How old are you?",
}

ENTER_NAME = {
    "UA": "Напиши своє ім'я:",
    "RU": "Напиши свое имя:",
    "EN": "Enter your name:",
}

CHOOSE_INTEREST = {
    "UA": "Хто тебе цікавить?",
    "RU": "Кто тебе интересен?",
    "EN": "Who are you interested in?",
}

BOYS = {
    "UA": "Хлопці",
    "RU": "Парни",
    "EN": "Boys",
}

GIRLS = {
    "UA": "Дівчата",
    "RU": "Девушки",
    "EN": "Girls",
}

ALL = {
    "UA": "Все одно",
    "RU": "Всё равно",
    "EN": "All",
}

ENTER_LOCATION = {
    "UA": "Введи назву свого місцезнаходження (місто, село, район, універ, будь-що) або відправ геологацію місця:",
    "RU": "Введи название своего местонахождения (город, село, район, универ, что-угодно) "
          "или отправь геолокацию места:",
    "EN": "Enter the name of your location (city, village, district, university, whatever) or send the geolocation of "
          "the place:",
}

NOT_FOUND_LOCATION = {
    "UA": "Локацію не знайдено, спробуй ще раз:",
    "RU": "Локацию не найдено, попробуй снова:",
    "EN": "Location not found, try again:",
}

SEND_LOCATION = {
    "UA": "Відправити локацію",
    "RU": "Отправить локацию",
    "EN": "Send location",
}

SElECT_LOCATION = {
    "UA": "Обери локацію зі списка:",
    "RU": "Выбери локацию из списка:",
    "EN": "Select location from list:",
}