language_codes = {
    "🇺🇦 Українська": "UA",
    "🇬🇧 English": "EN",
    "🇷🇺 Русский": "RU",
}

CHOOSE_LANGUAGE = {
    "UA": "Привіт! Обери бажану мову для спілкування з ботом:",
    "RU": "Привет! Выбери желаемый язык для общения с ботом:",
    "EN": "Hello! Choose the language you want to communicate with the bot:",
}

CHOOSE_LANGUAGE_PROFILE = {
    "UA": "Обери бажану мову для спілкування з ботом:",
    "RU": "Выбери желаемый язык для общения с ботом:",
    "EN": "Choose the language you want to communicate with the bot:",
}

CHOOSE_SEX = {
    "UA": "Якої ти статі?",
    "RU": "Укажи свой пол:",
    "EN": "Select your sex:",
}

MAN = {
    "UA": "Хлопець",
    "RU": "Парень",
    "EN": "Boy",
}

WOMAN = {
    "UA": "Дівчина",
    "RU": "Девушка",
    "EN": "Girl",
}

ENTER_AGE = {
    "UA": "Скільки тобі років?",
    "RU": "Сколько тебе лет?",
    "EN": "How old are you?",
}

ENTER_NAME = {
    "UA": "Напиши своє ім'я:",
    "RU": "Напиши свое имя:",
    "EN": "Enter your name:",
}

CHOOSE_INTEREST = {
    "UA": "Хто тебе цікавить?",
    "RU": "Кто тебе интересен?",
    "EN": "Who are you interested in?",
}

BOYS = {
    "UA": "Хлопці",
    "RU": "Парни",
    "EN": "Boys",
}

GIRLS = {
    "UA": "Дівчата",
    "RU": "Девушки",
    "EN": "Girls",
}

ALL = {
    "UA": "Все одно",
    "RU": "Всё равно",
    "EN": "All",
}

ENTER_LOCATION = {
    "UA": "Введи назву свого місцезнаходження (місто, село, район, універ, будь-що) або відправ геолокацію місця:",
    "RU": "Введи название своего местонахождения (город, село, район, универ, что-угодно) "
          "или отправь геолокацию места:",
    "EN": "Enter the name of your location (city, village, district, university, whatever) or send the geolocation of "
          "the place:",
}

NOT_FOUND_LOCATION = {
    "UA": "Локацію не знайдено, спробуй ще раз:",
    "RU": "Локацию не найдено, попробуй снова:",
    "EN": "Location not found, try again:",
}

SEND_LOCATION = {
    "UA": "Відправити локацію",
    "RU": "Отправить локацию",
    "EN": "Send location",
}

SElECT_LOCATION = {
    "UA": "Обери локацію зі списка:",
    "RU": "Выбери локацию из списка:",
    "EN": "Select location from list:",
}

SEND_PHOTO = {
    "UA": "Надішли фото або відео, які будуть відображені у твоїй анкеті. Завантажено %s фото та %s відео.",
    "RU": "Отправь фотографии или видео, которые будут отображены в твоей анкете."
          " Загружено %s фото и %s видео.",
    "EN": "Sent a photo or video that will be displayed in your profile. Loaded %s photos and %s videos",
}

ENOUGH_PHOTO = {
    "UA": "Зберегти",
    "RU": "Сохранить",
    "EN": "Save",
}

BACK = {
    "UA": "Назад",
    "RU": "Назад",
    "EN": "Back",
}

SKIP = {
    "UA": "Пропустити",
    "RU": "Пропустить",
    "EN": "Skip",
}

ENTER_DESCRIPTION = {
    "UA": "Розкажи про себе, кого хочеш знайти:",
    "RU": "Расскажи о себе, кого хочешь найти:",
    "EN": "Tell me about yourself, who do you want to find:",
}

MY_PROFILE = {
    "UA": "{name}, {years} років, {place}{description}",
    "RU": "{name}, {years} лет, {place}{description}",
    "EN": "{name}, {years} y.o., {place}{description}",
}

CHANGE_MAIN = {
    "UA": "Переключити аватар",
    "RU": "Переключить аватар",
    "EN": "Switch avatar",
}

EDIT_PROFILE = {
    "UA": "Редагувати анекту",
    "RU": "Редактировать анкету",
    "EN": "Edit Profile",
}

SAVE_CURRENT = {
    "UA": "Зберегти поточну",
    "RU": "Сохранить текущую",
    "EN": "Save current",
}

REMOVE_ALL_PHOTO = {
    "UA": "Видалити всі фото",
    "RU": "Удалить все фото",
    "EN": "Remove all photo",
}

SAVE_CURRENT_DESC = {
    "UA": "Зберегти поточний текст",
    "RU": "Сохранить текущий текст",
    "EN": "Save current text",
}

WATCH_PROFILE = {
    "UA": "Переглянути анекту",
    "RU": "Посмотреть анкету",
    "EN": "Watch profile",
}
