language_codes = {
    "🇺🇦 Українська": "UA",
    "🇬🇧 English": "EN",
    "🇷🇺 Русский": "RU",
}

CHOOSE_LANGUAGE = {
    "UA": "Привіт! Обери бажану мову для спілкування з ботом:",
    "RU": "Привет! Выбери желаемый язык для общения с ботом:",
    "EN": "Hello! Choose the language you want to communicate with the bot:",
}

CHOOSE_SEX = {
    "UA": "Якої ти статі?",
    "RU": "Укажи свой пол:",
    "EN": "Select your sex:",
}

MAN = {
    "UA": "Хлопець",
    "RU": "Парень",
    "EN": "Boy",
}

WOMAN = {
    "UA": "Дівчина",
    "RU": "Девушка",
    "EN": "Girl",
}

ENTER_AGE = {
    "UA": "Скільки тобі років?",
    "RU": "Сколько тебе лет?",
    "EN": "How old are you?",
}

ENTER_NAME = {
    "UA": "Напиши своє ім'я:",
    "RU": "Напиши свое имя:",
    "EN": "Enter your name:",
}

CHOOSE_INTEREST = {
    "UA": "Хто тебе цікавить?",
    "RU": "Кто тебе интересен?",
    "EN": "Who are you interested in?",
}

BOYS = {
    "UA": "Хлопці",
    "RU": "Парни",
    "EN": "Boys",
}

GIRLS = {
    "UA": "Дівчата",
    "RU": "Девушки",
    "EN": "Girls",
}

ALL = {
    "UA": "Все одно",
    "RU": "Всё равно",
    "EN": "All",
}
